Revit 2027 API
IndependentTag.SetLeaderEnd Method
 Sets the free end point for the leader to the specified reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLeaderEnd(
	Reference referenceTagged,
	XYZ freeLeaderEndPoint
)
Public Sub SetLeaderEnd (
	referenceTagged As Reference,
	freeLeaderEndPoint As XYZ
)
public:
void SetLeaderEnd(
	Reference^ referenceTagged,
	XYZ^ freeLeaderEndPoint
)
member SetLeaderEnd :
        referenceTagged : Reference *
        freeLeaderEndPoint : XYZ -> unit
Parameters
referenceTagged Reference
 The reference which is tagged.
freeLeaderEndPoint XYZ
 A point representing the free end location for the leader.
Exceptions
Exception | Condition
ArgumentException |  There is no leader end because the tag does not use a free end leader or the leader is not visible. -or- The specified reference is not currently tagged.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The IndependentTag object does not have a tag behavior. -or- For this tag leaders are not allowed.
Remarks
 Tags with attached leader ends or no leaders do not support setting free leader end points. LeaderEndCondition for the tag's leader end condition.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace